Repository: esubalew-gosaye/advanced-django-project
Catalog: locale/*/LC_MESSAGES/django.po
Languages: am

source: User Details
am: የአባል መረጃ

source: Take me back
am: ወድ ኋላ ተምልስ

source: username
am: ልዩ ስም

source: email
am: ኢሜይል

source: Permissions
am: ፍቃዶች

source: Groups
am: ቡድኖች

source: Group Creation Form
am: ቡድን መመዝገቢያ ቅጽ

source: Group Name
am: የቡድን ስም

source: Enter group name
am: የቡድን ስም አስገቡ

source: Create Group
am: ቡድን መዝግብ

source: Group Details
am: የአባል መረጃ

source: Group name
am: የቡድን ስም

source: Group permissions
am: የቡድን ፍቃዶች

source: Users in the group
am: በቡድኑ ውስጥ ያሉ አባላት

source: User List
am: የአባል ዝርዝር

source: List Groups
am: ቡድኖችን ዘርዝር

source: We display 4 permission only here, check detail for more
am: አዚህ 4 ፍቃዶች ብቻ ነው ሚታዩት፤ ለተጨማሪ የአባሉን መረጃ ይዩ

source: Username
am: ልዩ ስም

source: Email
am: ኢሜይል

source: Permission
am: ፍቃድ

source: Actions
am: ተግብር

source: Update
am: አዘምን

source: View
am: መረጃ

source: Delete
am: አጥፋ

source: You don't have a permission to view users
am: አባላትን ለማየት መብት የልህም/ሽም

source: Group List
am: ቡድኖች

source: List Users
am: የአባል ዝርዝር

source: Name
am: ስም

source: You don't have a permission to view groups
am: ቡድኖችን ለማየት መብት የልህም/ሽም

source: Login Page
am: መግቢያ ገጽ

source: Enter email
am: ኢሜይል አስገባ

source: Password
am: ሚስጥራዊ ቁልፍ

source: Enter password
am: ሚስጥራዊ ቁልፍ አስገባ

source: Login
am: ግባ

source: Home
am: ዋና ገጽ

source: Create User
am: አባል መዝግብ

source: Logout
am: ውጣ

source: Languages
am: ቋንቋዎች

source: Group Updation Form
am: ቡድን ማዘመኛ ቅጽ

source: Update Group
am: ቡድን አዘምን

source: User Updation Form
am: አባል መረጃ ማዘመኛ ቅጽ

source: Enter username
am: ኢሜይል አስገባ

source: Role
am: መደብ

source: Select role
am: መደብ ምረጥ

source: Admin has all Permission by default
am: አስተዳዳሪው ሙሉ መብት ይኖረዋል

source: Group
am: ቡድኖች

source: Update User
am: አባል መዝግብ

source: User Creation Form
am: አባል መመዝገቢያ ቅጽ
